testdata/vlanHandlerCommit.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xs="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:inv="http://ossj.org/xml/Inventory/v1-2"
	xmlns:cbecore="http://ossj.org/xml/Common-CBECore/v1-5"
	xmlns:com="http://ossj.org/xml/Common/v1-5"
	xmlns:res="http://ossj.org/xml/Common-CBEResource/v1-5">
	<soapenv:Header>
	</soapenv:Header>
	<soapenv:Body>
		<inv:setEntitiesByValuesRequest>
			<inv:entityValues
				xsi:type="cbecore:ArrayOfEntityValue">
				<cbecore:item xsi:type="res:ResourceValue">
					<com:key xsi:type="res:ResourceKey">
						<com:type xsi:type="xs:string">EODCVLAN</com:type>
						<com:primaryKey xsi:type="xs:string">INVLAN 4000:60</com:primaryKey>
					</com:key>
					<cbecore:describedBy>
						<cbecore:item>
							<cbecore:value>Assigned</cbecore:value>
							<cbecore:characteristic>Status</cbecore:characteristic>
						</cbecore:item>
					</cbecore:describedBy>
				</cbecore:item>
			</inv:entityValues>
		</inv:setEntitiesByValuesRequest>
	</soapenv:Body>
</soapenv:Envelope>
